<?php
  // $d = strtotime("2012-09-10");
  //$d執行結果為1347235200
  //date("Y-m-d", $d)執行結果為2012-09-10
  
  // $d = strtotime("2012-09-10 -3 days");
  //$d執行結果為1346976000，-3 days要求減去3天的秒差(3天*24小時*60分*60秒，共259200秒)
  //date("Y-m-d", $d)執行結果為2012-09-07，-3 days為顯示3天前的日期
  
  $d = strtotime("2012-09-10 +1 month");
  //$d執行結果為1349827200，+1 month要求加一個月的時間(30天*24小時*60分*60秒，共2592000秒)
  //date("Y-m-d", $d)執行結果為2012-10-10，+1 month為顯示1個月之後的日期
  echo $d;  //顯示時間戳記
  echo "<br>";
  echo date("Y-m-d", $d);//顯示("年-月-日")
?>
